tutorials/meaTube/constant/film/chemistryProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      chemistryProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

chemistryType
{
    solver  EulerImplicit;
}

chemistry   on;

initialChemicalTimeStep 1e-07;

EulerImplicitCoeffs
{
    cTauChem                1;
}

odeCoeffs
{
    solver      Rosenbrock43;
    absTol      1e-8;
    relTol      0.01;
}

#include "reactions"

// ************************************************************************* //
