tutorials/meaTube/constant/film/reactions
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Reference:

\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      reactions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

reactions
{
    rxn1
    {
        type        irreversibleArrhenius;

        reaction    "2MEA + CO2 = MEACOO- + MEA+";
        
        A           4.61e+9;
        beta        0.0;
        Ta          4412;
    }
    
    rxn2
    {
        type        irreversibleArrhenius;
        
        reaction    "MEA + CO2 + H2O = MEACOO- + H3O+";
        
        A           4.55e+6;
        beta        0.0;
        Ta          3287;
    }
}


// ************************************************************************* //
