tutorials/meaTube/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0.3236);

boundaryField
{
    bottom
    {
        type            fixedValue;
        value           uniform (0 0 0.3236);
    }

    top
    {
        type            zeroGradient;
    }

    film
    {
        type            mappedValue;
        value           $internalField;
    }

    "(side.*)"
    {
        type            wedge;
    }
}

// ************************************************************************* //
