tutorials/meaTube/0/film/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{
    "(top|bottom|wall)"
    {
        type            zeroGradient;
    }

    surface
    {
        type            mappedFilmPressure;
        value           $internalField;
    }

    "(side.*)"
    {
        type            symmetry;
    }
}


// ************************************************************************* //
