tutorials/meaTube/0/film/MEA+
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      MEA+;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    top
    {
        type            fixedValue;
        value           $internalField;
    }
    
    "(bottom|wall|surface)"
    {
        type            zeroGradient;
    }
    
    "(side.*)"
    {
        type            symmetry;
    }
}

// ************************************************************************* //
