tutorials/meaTube/0/film/T
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0/film";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    bottom
    {
        type            zeroGradient;
    }

    top
    {
        type            fixedValue;
        value           $internalField;
    }

    surface
    {
        type            coupledTemperature;
        value           $internalField;
    }

    wall
    {
        type            mixedTemperature;
        h               450;
        Tinf            $internalField;
        value           $internalField;
    }

    "(side.*)"
    {
        type            symmetry;
    }
}

// ************************************************************************* //
