tutorials/meaTube/system/film/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system/film";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "alpha.*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-10;
        relTol          0;
    }

    "(U|e).*"
    {
        solver          PBiCGStab;
        preconditioner  DILU;

        tolerance       1e-10;
        relTol          0;
    }

	"(h|Yi|O2|N2|H2O).*"
	{
		solver          PBiCGStab;
		preconditioner  DILU;
		tolerance       1e-6;
		relTol          0;
	}
}

PIMPLE
{
    momentumPredictor yes;
    nOuterCorrectors  2;
    nCorrectors       1;
    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    equations
    {
        ".*"        1;
    }
}


// ************************************************************************* //
